<!DOCTYPE html>
<html lang="pt-br">

<head>
     <!-- Global site tag (gtag.js) - Google Analytics -->
<script async src="https://www.googletagmanager.com/gtag/js?id=UA-160618603-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-160618603-1');
</script>

  
<script data-ad-client="ca-pub-5399975515756281" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
  <link rel="shortcut icon" HREF="https://datacryptoml.000webhostapp.com/icon_DataCrypto.png">

  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta http-equiv='X-UA-Compatible' content='IE=edge'>
  <meta name='viewport' content='width=device-width, initial-scale=1' />
  <meta name='description' content='Entenda como os ataques Web acontecem. Curso básico, compilado de forma clara para os tipos de ataques e falhas web'>
  <meta property='og:locale' content='pt-BR'>
  <meta property='og:title' content='Curso vulnerabilidade Web'>
  <meta property='og:description' content='Entenda como os ataques Web acontecem. Curso básico, compilado de forma clara para os tipos de ataques e falhas web'>
  <!-- <link rel="shortcut icon" href="img/favicon.ico" type="image/x-icon">
  <link rel="icon" href="img/favicon.ico" type="image/x-icon"> -->
  <link rel="stylesheet" type="text/css" href="assets/css/reset.css">
  <link rel="stylesheet" type="text/css" href="assets/css/root.css">
  <link rel="stylesheet" type="text/css" href="assets/css/geral.css">
  <link rel="stylesheet" type="text/css" href="assets/css/normalize.css">
  <link rel="stylesheet" type="text/css" href="assets/css/footer.css">
  <link rel="stylesheet" type="text/css" href="assets/css/main.min.css">
  <link async rel="stylesheet" href="https://use.fontawesome.com/releases/v5.7.2/css/all.css" integrity="sha384-fnmOCqbTlWIlj8LyTjo7mOUStjsKC4pOpQbqyi7RrhN7udi9RwhKkMHpvLbHG9Sr" crossorigin="anonymous">
  <link async href="https://fonts.sgoogleapis.com/css?family=Open+Sans:400,700" rel="stylesheet">
  <script type="text/javascript" src="assets/js/main.min.js"></script>
  <title>Curso vulnerabilidades Web</title>
</head>
  <body class="landing-page">
    <div class="acessibilidade oculta-texto">
        <!-- <a href="#main">Ir para conteúdo</a> -->
    </div>
    
    <header class="header">
  <div class="header-topo">
    <div class="wrapper">
       <figure class="header-topo__img">
         <a href="https://datacryptoanalytics.ml/" title="DataCrypto Analytics Blog">
            <img src="https://datacryptoml.000webhostapp.com/img/datacrypto-analytics.png" alt="DataCrypto Analytics Blog"> 
        </a>
     </figure>
    </div>
  </div>
  <div class="header-background">
    <div class="wrapper">
      <div class="header-content">
        <div class="header-content__midia">
                                <figure class="header-content__midia--content">
              <img src="assets/img/header.png" alt="assets/img/header.png" class="--img">
            </figure>
            
            
            
            
                  </div>
        <section class="header-content__titles">
                      <h1 class="header-content__title">Curso vulnerabilidades Web</h1>
                                <h2 class="header-content__subtitle">Entenda como os ataques Web acontecem</h2>
                  </section>
        <div class="header-content__editor">
          <div class="header-content__editor--paragraph">
            <div class="landing-editor">
              <p><span style="color: #ffffff;">Curso b&aacute;sico, compilado de forma clara para os tipos de ataques e falhas web, no curso teremos as seguintes aulas.</span></p>
<p><span style="color: #ffffff;">- <strong>Aula 1</strong> | Introdu&ccedil;&atilde;o ao protocolo HTTP</span></p>
<p><span style="color: #ffffff;">- <strong>Aula 2</strong> | Cabe&ccedil;alho HTTP </span></p>
<p><span style="color: #ffffff;">- <strong>Aula 3</strong> | Postman</span></p>
<p><span style="color: #ffffff;">-<strong> Aula 4</strong> | Manipulando Cookie e Sess&otilde;es</span></p>
<p><span style="color: #ffffff;">- <strong>Aula 5</strong> | Requisi&ccedil;&otilde;es web em Curl e Wget</span></p>
<p><span style="color: #ffffff;">- <strong>Aula 6</strong> | Requisi&ccedil;&otilde;es web com Urllib e Requests</span></p>
<p><span style="color: #ffffff;">- <strong>Aula 7</strong> | Burpsuite</span></p>
            </div>
          </div>
                    <a rel="noopener noreferrer nofollow" href="https://app.monetizze.com.br/checkout/KVR84613" class="header-content__editor--button">Quero comprar</a>
                  </div>
      </div>
    </div>
  </div>
</header>

    <section class="problem">
  <div class="wrapper">
    <div class="problem__content">
              <h3 class="problem__title">Tipos de ataques Web</h3>
      
      <article class="problem__editor --first">
        <div class="landing-editor">
                      <p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><em><span style="color: #ffffff;"><strong>- Inje&ccedil;&atilde;o</strong></span></em></p>
<p style="text-align: left;"><span style="color: #ffffff;">As falhas de inje&ccedil;&atilde;o, como SQL, OS, XXE e LDAP, ocorrem quando dados n&atilde;o confi&aacute;veis s&atilde;o enviados para um int&eacute;rprete como parte de um comando ou consulta. Por exemplo, na tela de administra&ccedil;&atilde;o do seu sistema, voc&ecirc; tem que digitar um usu&aacute;rio e senha para acessar, por tr&aacute;s desse formul&aacute;rio de acesso, o seu sistema normalmente realiza uma consulta ao banco de dados, para verificar se o usu&aacute;rio existe e a senha digitada est&aacute; correta, o comando para a execu&ccedil;&atilde;o &eacute; basicamente o seguinte:</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">SELECT id FROM USUARIOS WHERE usu&aacute;rio = &lsquo;textoDigitado&rsquo; &amp;&amp; senha = &lsquo;textoDigitado2&rsquo;</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">Esse c&oacute;digo seleciona o n&uacute;mero de identifica&ccedil;&atilde;o do usu&aacute;rio, que tem o mesmo nome e senha digitado no formul&aacute;rio, retornando o resultado ele libera o acesso ao sistema, o grande problema &eacute; que utilizando inje&ccedil;&atilde;o, poder&iacute;amos no textoDigitado informar o seguinte:</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">&lsquo; OR 1=1</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">Que ao ser processado pelo sistema, iria influenciar diretamente no contexto, agora o sistema verifica se o usu&aacute;rio &eacute; igual a vazio ou 1 &eacute; igual a 1, caso verdadeiro, ele pega o primeiro usu&aacute;rio do sistema e libera o acesso.</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">Entendeu o perigo? &Eacute; poss&iacute;vel que o invasor acesse o seu sistema, sem saber nem o usu&aacute;rio e nem a senha.</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><em><span style="color: #ffffff;"><strong>- Gerenciamento de sess&atilde;o e quebras de autentica&ccedil;&atilde;o</strong> </span></em></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">Um dos pontos principais de uma aplica&ccedil;&atilde;o &eacute; como ela lida com a sess&atilde;o e a autentica&ccedil;&atilde;o do usu&aacute;rio, explicando um pouco o funcionamento, o seu formul&aacute;rio de acesso verifica se os dados est&atilde;o corretos e cria uma sess&atilde;o, informando que o seu acesso foi autorizado, se essa fun&ccedil;&atilde;o for implementada de maneira incorreta, pode permitir que invasores comprometam senhas, chaves ou tokens de sess&atilde;o, e at&eacute; mesmo explorem falhas de implementa&ccedil;&atilde;o para assumir identidades de outros usu&aacute;rios no sistema.</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">Por exemplo, se no seu formul&aacute;rio de acesso, &eacute; adicionado o c&oacute;digo do usu&aacute;rio atrav&eacute;s do m&eacute;todo POST(m&eacute;todo padr&atilde;o de envio de formul&aacute;rio), pode ser utilizado o Tamper Data ou outro aplicativo similar para realizar a manipula&ccedil;&atilde;o da informa&ccedil;&atilde;o que ser&aacute; inserida na se&ccedil;&atilde;o, nesse ponto ao inv&eacute;s de inserir o c&oacute;digo do usu&aacute;rio &ldquo;Jo&atilde;o&rdquo; na sess&atilde;o, podemos alterar e passar o c&oacute;digo do usu&aacute;rio &ldquo;Jos&eacute;&rdquo;.</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">Esse &eacute; um exemplo b&aacute;sico, mas existem milh&otilde;es de possibilidades para utilizar essa vulnerabilidade, caso a aplica&ccedil;&atilde;o n&atilde;o seja implementada corretamente. Seria impactante para o seu neg&oacute;cio, se um usu&aacute;rio comum, conseguisse acessar o sistema com o usu&aacute;rio de um diretor ou gerente?</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><em><span style="color: #ffffff;"><strong>- Cross-Site Scripting (XSS)</strong></span></em></p>
<p style="text-align: left;"><span style="color: #ffffff;">Uma falha XSS ocorre sempre que um aplicativo inclui dados n&atilde;o confi&aacute;veis em uma nova p&aacute;gina da web sem validar ou escapar adequadamente. O XSS permite que os invasores executem scripts no navegador da v&iacute;tima, por sua vez, esses scripts podem redirecionar a v&iacute;tima para um site malicioso ou at&eacute; mesmo sequestrar sess&otilde;es de usu&aacute;rios.</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">Por exemplo, se voc&ecirc; tem uma conta no banco Digital30 que utiliza o m&eacute;todo GET para realizar transfer&ecirc;ncias sem prote&ccedil;&atilde;o contra CSRF (8), e voc&ecirc; acessa o blog do &ldquo;Jo&atilde;o&rdquo;, e o blog tem uma falha de XSS que permitiu um invasor inserir um c&oacute;digo malicioso na &aacute;rea de coment&aacute;rios, n&atilde;o havia nenhum filtro de c&oacute;digo no coment&aacute;rio, agora todos que acessam a p&aacute;gina de coment&aacute;rios t&ecirc;m um script executado no computador. Esse script em espec&iacute;fico acessa a p&aacute;gina digital30.com/transfer.php?value=500&amp;to=0200, como voc&ecirc; estava autenticado no banco, ao acessar o blog, a falha fez com que executasse uma a&ccedil;&atilde;o dentro do banco, que transferiu R$ 500,00 para a conta 0200.</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">L&oacute;gico que, bancos possuem uma prote&ccedil;&atilde;o e v&aacute;rias camadas para realizar transfer&ecirc;ncias, o que torna mais complicado, mas esse exemplo &eacute; s&oacute; para mostrar o poder de um XSS.</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">Olhando pelo lado do defacer, uma esp&eacute;cie de pichador digital, XSS &eacute; uma &oacute;tima forma de afetar p&aacute;ginas, j&aacute; que atrav&eacute;s de um XSS, voc&ecirc; pode redirecionar a v&iacute;tima para outro site. Imagina todos seus clientes acessando o seu site e sendo redirecionados para uma p&aacute;gina pornogr&aacute;fica? Simplesmente porque seu desenvolvedor se esqueceu de filtrar c&oacute;digo nos coment&aacute;rios da p&aacute;gina. Qual seria o impacto para a sua marca?</span></p>
<p style="text-align: left;"><em><span style="color: #ffffff;"><strong>- Quebras no controle de acesso</strong></span></em></p>
<p style="text-align: left;"><span style="color: #ffffff;">Uma aplica&ccedil;&atilde;o normalmente atua com sistema de permiss&otilde;es, que define o que cada usu&aacute;rio pode fazer no sistema, outro ponto &eacute; que as p&aacute;ginas do seu sistema precisam que o usu&aacute;rio esteja autenticado para serem acessadas, no entanto, essa vulnerabilidade ocorre quando essa verifica&ccedil;&atilde;o ou n&atilde;o foi feita da maneira correta, ou simplesmente n&atilde;o foi feita.</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">Por exemplo, dentro de um sistema, se o desenvolvedor se esquecer de verificar na p&aacute;gina de cadastro de usu&aacute;rios se o usu&aacute;rio atual est&aacute; autenticado, &eacute; poss&iacute;vel que um invasor utilize essa falha para acessar a p&aacute;gina diretamente atrav&eacute;s de scripts de for&ccedil;a bruta, que testa v&aacute;rias possibilidades, como por exemplo seusite.com.br/a, seusite.com.br/aa, at&eacute; testar todas as possibilidades, caso durante esse teste o invasor encontre a p&aacute;gina seusite.com.br/usuarios/cadastro e a mesma n&atilde;o tiver uma verifica&ccedil;&atilde;o de autentica&ccedil;&atilde;o, mesmo sem ter um usu&aacute;rio e senha do sistema &eacute; poss&iacute;vel cadastrar um usu&aacute;rio e obter acesso total.</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;"><span style="color: #ffffff;">Tamb&eacute;m &eacute; muito comum o usu&aacute;rio s&oacute; ter permiss&atilde;o de consultar alguma informa&ccedil;&atilde;o, mas por algum erro do desenvolvedor, ser poss&iacute;vel editar ou excluir algumas informa&ccedil;&otilde;es, isso pode ser utilizado pelo invasor e pode impactar diretamente no seu neg&oacute;cio.</span></p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;">&nbsp;</p>
<p style="text-align: left;">&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
                  </div>
      </article>

      <article class="problem__editor --second">
        <div class="landing-editor">
                      <p style="text-align: right;"><em><span style="color: #ffffff;"><strong>- Exposi&ccedil;&atilde;o de dados sens&iacute;veis</strong> </span></em></p>
<p style="text-align: right;"><span style="color: #ffffff;">Muitas aplica&ccedil;&otilde;es web n&atilde;o protegem de forma adequada os dados confidenciais, como dados financeiros. Os atacantes podem roubar ou modificar esses dados deficientemente protegidos, para conduzir fraudes em cart&otilde;es de cr&eacute;ditos, roubar identidades ou outros crimes. Dados sens&iacute;veis devem possuir uma prote&ccedil;&atilde;o extra, como uma criptografia.</span></p>
<p style="text-align: right;"><span style="color: #ffffff;">Por exemplo, se voc&ecirc; est&aacute; dentro de um restaurante utilizando um sistema de pagamentos que n&atilde;o possui criptografia (HTTPS), e digitou as informa&ccedil;&otilde;es do seu cart&atilde;o de cr&eacute;dito para realizar uma compra, um atacante mal intencionado, utilizando aplica&ccedil;&otilde;es de an&aacute;lise de tr&aacute;fego pode capturar as informa&ccedil;&otilde;es, outro ponto bastante comum &eacute; que um invasor obtendo acesso ao mesmo sistema atrav&eacute;s do item (1), pode obter todas as informa&ccedil;&otilde;es dos cart&otilde;es de cr&eacute;ditos j&aacute; utilizados no sistema, caso n&atilde;o possua um tipo de criptografia.</span></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><span style="color: #ffffff;">&nbsp;</span></p>
<p style="text-align: right;"><em><span style="color: #ffffff;">- <strong>Prote&ccedil;&atilde;o de ataque insuficiente</strong> </span></em></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><span style="color: #ffffff;">A maioria dos aplicativos n&atilde;o possui capacidade b&aacute;sica para detectar, prevenir e responder a ataques manuais e automatizados. A prote&ccedil;&atilde;o de ataques vai muito al&eacute;m da valida&ccedil;&atilde;o de entrada b&aacute;sica e envolve a detec&ccedil;&atilde;o, resposta e at&eacute; bloqueio de tentativa de explora&ccedil;&atilde;o.</span></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><span style="color: #ffffff;">Por exemplo, no item (4) falamos sobre um script, capaz de realizar m&uacute;ltiplas combina&ccedil;&otilde;es de caracteres para encontrar p&aacute;ginas acess&iacute;veis em um determinado sistema, no entanto, uma aplica&ccedil;&atilde;o robusta e com um n&iacute;vel de seguran&ccedil;a razo&aacute;vel deveria impedir isso atrav&eacute;s da utiliza&ccedil;&atilde;o de um WAF &ndash; Web Application Firewall.</span></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><span style="color: #ffffff;">Esse tipo de detec&ccedil;&atilde;o de anomalias &eacute; fundamental para a prote&ccedil;&atilde;o da sua aplica&ccedil;&atilde;o, por exemplo, ao realizar cada a&ccedil;&atilde;o deve ser realizado um reconhecimento, para verificar se h&aacute; algum padr&atilde;o malicioso e tomar a devida atitude, que seja apenas o registro de informa&ccedil;&atilde;o para que o administrador execute uma a&ccedil;&atilde;o, como a corre&ccedil;&atilde;o de uma vulnerabilidade, ou at&eacute; mesmo para bloquear o acesso do poss&iacute;vel invasor.</span></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><em><span style="color: #ffffff;">- <strong>Cross-Site Request Forgery (CSRF)</strong> </span></em></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><span style="color: #ffffff;">Um ataque CSRF for&ccedil;a o navegador da v&iacute;tima autenticada a enviar uma solicita&ccedil;&atilde;o forjada para uma aplica&ccedil;&atilde;o vulner&aacute;vel, dessa forma a aplica&ccedil;&atilde;o vulner&aacute;vel pensa ser solicita&ccedil;&otilde;es leg&iacute;timas da v&iacute;tima.</span></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><span style="color: #ffffff;">Por exemplo, o invasor pode colocar dentro do site isca, um script que simula o acesso ao link meusite.com.br/conta/alterar/senha?novasenha=123456, caso o usu&aacute;rio esteja autenticado no site alvo(meusite.com.br) a sua senha ser&aacute; alterada para 123456, apenas por acessar o site do invasor. Ou seja, ao acessar outro site &eacute; poss&iacute;vel que ele execute a&ccedil;&otilde;es no site vulner&aacute;vel sem o teu consentimento, tamb&eacute;m &eacute; comum a utiliza&ccedil;&atilde;o dessa falha enviando o link encurtado (goo.gl,&nbsp; bit.ly), que executa a a&ccedil;&atilde;o para a v&iacute;tima, sendo assim, ao clicar a a&ccedil;&atilde;o &eacute; executada e algumas vezes a v&iacute;tima nem percebe o golpe.</span></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><em><span style="color: #ffffff;">- <strong>Utilizar componentes com vulnerabilidades conhecidas</strong> </span></em></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><span style="color: #ffffff;">Aplicativos, APIs, bibliotecas, frameworks e outros m&oacute;dulos de softwares possuem vulnerabilidades, como eles s&atilde;o executados com os mesmos privil&eacute;gios que a aplica&ccedil;&atilde;o, se um componente vulner&aacute;vel for explorado, toda a aplica&ccedil;&atilde;o pode ser colocada em risco. Por isso &eacute; fundamental que seja documentado todos os m&oacute;dulos de terceiros utilizados no projeto e que seja acompanhado a atualiza&ccedil;&atilde;o desses projetos, para que a aplica&ccedil;&atilde;o tenha sempre a vers&atilde;o mais atual dos m&oacute;dulos de terceiros, para aumentar ao m&aacute;ximo o n&iacute;vel da seguran&ccedil;a do mesmo.</span></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><span style="color: #ffffff;">Por exemplo, uma aplica&ccedil;&atilde;o que utiliza o plug-in ComentsEasy, pode estar vulner&aacute;vel a inje&ccedil;&atilde;o, caso o ComentsEasy n&atilde;o trate esse item, ou seja, &eacute; poss&iacute;vel que exista vulnerabilidades, por isso &eacute; fundamental verificar a real necessidade de utilizar m&oacute;dulos de terceiros, e quando for utilizar, acompanhar as atualiza&ccedil;&otilde;es para que n&atilde;o utilize vers&otilde;es desatualizadas e com falhas conhecidas. </span></p>
<p style="text-align: right;"><em><span style="color: #ffffff;"><strong>- APIs desprotegidas</strong></span></em></p>
<p style="text-align: right;"><span style="color: #ffffff;">Aplica&ccedil;&otilde;es modernas geralmente utilizam APIs, por exemplo, aplicativos m&oacute;veis se comunicam com APIs (SOAP, XML, Rest, JSON e afins), para realizar consultas e demais transa&ccedil;&otilde;es com o banco de dados, esse tipo de pr&aacute;tica &eacute; recomendado, pois adiciona um n&iacute;vel extra de prote&ccedil;&atilde;o na comunica&ccedil;&atilde;o. O grande problema &eacute; quando essas APIs s&atilde;o desprotegidas ou cont&eacute;m v&aacute;rias vulnerabilidades.</span></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><span style="color: #ffffff;">Por exemplo, uma API de consulta ao banco de dados de um sistema financeiro, caso n&atilde;o esteja protegida, pode ser acessada diretamente e liberar a consulta de dados sigilosos a qualquer pessoa, mesmo que n&atilde;o esteja utilizando a aplica&ccedil;&atilde;o.</span></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><span style="color: #ffffff;">Ou seja, &eacute; fundamental manter o n&iacute;vel de seguran&ccedil;a nas APIs de comunica&ccedil;&atilde;o, pois a menor falha em um pequeno m&oacute;dulo do conjunto aplica&ccedil;&atilde;o pode colocar tudo a perder.</span></p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;"><em><span style="color: #ffffff;"><strong>- Configura&ccedil;&atilde;o incorreta de seguran&ccedil;a</strong> </span></em></p>
<p style="text-align: right;"><span style="color: #ffffff;">A seguran&ccedil;a da informa&ccedil;&atilde;o vai muito al&eacute;m de um script bem configurado, precisamos ter um conceito de seguran&ccedil;a amplamente aplicado, com uma configura&ccedil;&atilde;o de seguran&ccedil;a bem definida e implantada para o servidor web, servidor de banco de dados, plataforma e etc. Como citamos no in&iacute;cio do artigo, precisamos manter as aplica&ccedil;&otilde;es do nosso servidor atualizadas, para que vulnerabilidades de terceiros, j&aacute; descobertas e corrigidas n&atilde;o possam prejudicar a seguran&ccedil;a do nosso servidor, a padroniza&ccedil;&atilde;o e normatiza&ccedil;&atilde;o dos modelos de seguran&ccedil;a do neg&oacute;cio, alinhados a pol&iacute;ticas rigorosas de seguran&ccedil;a s&atilde;o fundamentais para a continuidade do neg&oacute;cio.</span></p>
<p style="text-align: right;"><span style="color: #ffffff;">Por exemplo, se voc&ecirc; tem um c&oacute;digo robusto, amplamente testado, mas hospeda-o em um servi&ccedil;o de hospedagem de baixa qualidade, aonde sua aplica&ccedil;&atilde;o n&atilde;o tem nenhum tipo de prote&ccedil;&atilde;o contra ataques de nega&ccedil;&atilde;o de servi&ccedil;o, um atacante mal intencionado pode colocar o seu sistema fora do ar por tempo indeterminado, atrav&eacute;s de ataques, trazendo um preju&iacute;zo enorme para o seu neg&oacute;cio.</span></p>
<p style="text-align: right;">&nbsp;</p>
                  </div>
      </article>
            <a rel="noopener noreferrer nofollow" href="https://app.monetizze.com.br/checkout/KVR84613" class="problem__button">Quero comprar</a>
          </div>
  </div>
</section>

    <section class="solution">
  <div class="wrapper">
    <div class="solution__content">
              <h3 class="solution__title">Como tenho acesso ao curso? Vale a pena?</h3>
      
              <article class="solution__editor">
          <div class="landing-editor">
            <p><span style="color: #ffffff;">Depois de confirmado a compra voc&ecirc; recebera um acesso a nossa &aacute;rea de membros da Membertizze, l&aacute; voc&ecirc; vai encontrar os m&oacute;dulos e aulas disponiveis para o curso que escolheu, &aacute;lem do <em>Curso Vulnerabilidades Web</em> temos o <em>Curso b&aacute;sico Python voltado para Seguran&ccedil;a Computacional.</em></span></p>
<p><span style="color: #ffffff;">Nossos cursos s&atilde;o parcerias com terceiros, criadores dos cursos vendem a um pre&ccedil;o elevado. Depois que adquirimos o curso compartilhamos por uma fra&ccedil;&atilde;o do pre&ccedil;o, ou se preferir doe o que achar que vale, e disponilizamos o curso depois de nos enviar um email, queremos propagar o conhecimento.</span></p>
          </div>
        </article>
            <article class="solution__midia">
                          <figure class="solution__midia--content --img">
            <img src="assets/img/solution.png" alt="" class="--img">
          </figure>
              </article>
            <a  rel="noopener noreferrer nofollow" href="https://app.monetizze.com.br/checkout/KVR84613" class="solution__button">Quero comprar</a>
          </div>
  </div>
</section>

    <section class="warranty">
  <div class="wrapper">
    <div class="warranty__content">
      <div class="warranty__midia">
                  <figure class="warranty__midia--content">
            <img src="assets/img/warranty.png" alt="">
          </figure>
              </div>
              <div class="warranty__text">
          <div class="landing-editor">
               <div class="landing-editor"> <img src="https://sagapolicial.com/wp-content/uploads/2018/04/contato-png.png"  width="220"></div>
            <p><span style="color: #ffffff;">datacryptoanalytics@protonmail.com</span></p>
          </div>
        </div>
                  <a  rel="noopener noreferrer nofollow" href="https://app.monetizze.com.br/checkout/KVR84613" class="warranty__button">Quero comprar</a>
          </div>
  </div>
</section>

    <footer class="footer">
  <div class="wrapper">
    <div class="footer__content">
      <span class="footer__reserved">
        Curso vulnerabilidade Web © Todos os Direitos Reservados
      </span>
      <div class="footer__rights">
        <span class="footer__terms" id="termsBtn">Termos de uso</span>
        <span class="footer__privacy" id="privacyBtn">Política de privacidade</span>
      </div>
      <img src="https://datacryptoml.000webhostapp.com/img/btn_paypal.png" width="230">
      <p class="footer__dev">Esta página foi desenvolvida no ConvertPages</p>
    </div>
  </div>
</footer>

    <article class="terms" id="terms">
  <div class="terms__content">
    <header class="terms__header">
      <div class="wrapper">
        <h2 class="terms__title">Termos de uso</h2>
        <i aria-hidden="true" class="terms__icon" id="termsBtnClose"></i>
      </div>
    </header>
    <div class="terms__text">
      <div class="wrapper">
        <p>Uso livre</p>
      </div>
    </div>
  </div>
</article>

    <article class="privacy" id="privacy">
  <div class="privacy__content">
    <header class="privacy__header">
      <div class="wrapper">
        <h2 class="privacy__title">Políticas de privacidade</h2>
        <i aria-hidden="true" class="privacy__icon" id="privacyBtnClose"></i>
      </div>
    </header>
    <div class="privacy__text">
      <div class="wrapper">
        <p>N&atilde;o h&aacute; privacidade na internet</p>
      </div>
    </div>
  </div>
</article>

</body>
</html>
